# Дано: пользователь делает вклад в размере X рублей сроком на Y лет под 10% годовых 
# (каждый год размер его вклада увеличивается на 10%, эти деньги прибавляются к сумме вклада, 
# и на них в следующем году тоже будут проценты).

# Задача: написать функцию bank, принимающую аргументы X и Y и возвращающую сумму, 
# которая будет на счету пользователя спустя Y лет.

def bank (x,y):
    x = float(x)
    y = int(y)
    for i in range (y):
        x += x * 0.1
    return x

money = float(input("Введите сумму: "))
year = int(input("Введите количество лет: "))

result = bank (money, year)
print (f"Ваша итоговая сумма через {year} лет = {result} руб.")